<script setup lang="ts"></script>
<template>
  <title>z13 锐评</title>
  <div class="container">
    <div class="content">
      <p><del>壹万④千〇 6Ⅹ9</del> 14069 买的顶配, i9 处理器 配 4060 显卡的小平板 (和 14 寸 zenbook 一般大)</p>
      <p>规格参数参考官网的.</p>
      <h1 id="%E5%A4%9A%E5%9B%BE%E9%95%BF%E6%96%87%E9%A2%84%E8%AD%A6">
        <strong>多图长文预警</strong>
      </h1>
      <h2 id="%E8%B4%AD%E4%B9%B0%E5%92%8C%E6%94%B6%E8%B4%A7">购买和收货</h2>
      <p>
        发售当晚下单狗东, 在解禁下单前 0.2 秒抓包收到了一个事件, 把库存清零了, 所以本人通过肌肉反应完全抢不过脚本,
        虽然我也是软件工程师但我比较懒, 没有自研脚本去抢, 给各位码农丢脸了😎
      </p>
      <p>遂前往奸商宝加价下单;</p>
      <p>然后就是漫长的一天零两夜的漫漫长夜等待, 漫长, 十分漫长, 本急急国王高强度催客服把客服都催吐了.</p>
      <p>
        这里比较弱智的事情就是同城送, 我在北理上班离上地就二十分钟车程, 但是经销商不让我加钱发闪送, 强行等了一宿才配送.
      </p>
      <p>早上正做饭呢快递送来了.</p>
      <h2 id="%E5%BC%80%E7%AE%B1">开箱</h2>
      <p>做饭看锅呢, 随便拆了拆没什么好瞧的.</p>
      <p>
        <img src="/images/blogs/flow_z13/1.jpg" alt="看看我的粉色围裙" />
      </p>
      <h2 id="%E6%80%A7%E8%83%BD%E6%B5%8B%E8%AF%95">性能测试</h2>
      <p>分别测试了游戏性能和软件编译性能, 以及常规的硬件设备检查.</p>
      <h3
        id="%E9%A6%96%E5%85%88%E6%98%AF%E7%A0%8D%E6%98%9F%E8%BD%BD%E4%BA%BA%E5%AF%BC%E5%BC%B9%E7%A0%94%E7%A9%B6%E9%99%A2-2-%E7%9A%84%E6%B5%8B%E8%AF%95"
      >
        首先是砍星载人导弹研究院 2 的测试
      </h3>
      <p>画质拉满, 1080p 分辨率; 60 帧畅玩</p>
      <p>
        <img src="/images/blogs/flow_z13/2.jpg" alt="ksp2" />
        <img src="/images/blogs/flow_z13/3.jpg" alt="60 帧畅玩" />
        <img src="/images/blogs/flow_z13/4.jpg" alt="载人航天圆满成功" />
      </p>
      <h3 id="%E5%8E%9F%E5%AD%90%E4%B9%8B%E5%BF%83%E7%9A%84%E6%B5%8B%E8%AF%95">原子之心的测试</h3>
      <p>
        画质拉满, 不开 dlss, 2k 分辨率
        <img src="/images/blogs/flow_z13/5.jpg" alt="原子之心" />
        <img src="/images/blogs/flow_z13/6.jpg" alt="甚至有 40fps" />
      </p>
      <p>这个小平板属实手提核弹, 能跑到 40~50 帧, 完全超出了我的预期.</p>
      <h2 id="%E5%85%B6%E4%BB%96%E7%A1%AC%E4%BB%B6">其他硬件</h2>
      <p>
        非全贴合屏幕, 离近了斜着能看到背光板:
        <img src="/images/blogs/flow_z13/7.jpg" alt="屏幕" />
      </p>
      <p>
        自带的音响, 音质听起来非常不错:
        <img src="/images/blogs/flow_z13/8.jpg" alt="speaker" />
      </p>
      <p>内存:</p>
      <p>
        图忘传了, 口述一下就是 内存 bus 只有不到 600Mhz, 我的一位阿苏斯的工程师朋友对此锐评
        &quot;太低了&quot;、&quot;rog 用的最低档位性能&quot;, 他说固件更新后能修复这个拉跨点, 虽然但是他给我的 beta
        版本的固件我刷不上去.
      </p>
      <h2 id="%E7%BC%96%E8%AF%91%E8%BD%AF%E4%BB%B6">编译软件</h2>
      <p>跑了一个 nodejs 和 rust, 也就是 tauri 框架做的软件.</p>
      <p>
        图也忘传了, 性能好像蛮不错的, AMD 5800u 满载去编译要一分钟, 这个 i9 带下载依赖和编译就十秒钟,
        最高频率大核也跑到了 5.4 GHz.
      </p>
      <p>不过朋友说打游戏的时候 cpu 没有跑满, gpu 会有瓶颈, 然后还是说那个装不上的固件能修复, 我谔谔🤡.</p>
      <p>下周带到公司配一下硬件开发环境, 到时候其他的测试结果比如编译 rock bsp 之类的重型任务, 会附言到本贴下面.</p>
      <p>以及可能会存在的 linux 支持折腾, 准备装个 arch + hyprland 玩玩.</p>
      <h2 id="%E7%BB%AD%E8%88%AA">续航</h2>
      <p>54 瓦时的电池, 测试的时候电量为 94 %;</p>
      <p>外放音乐; 屏幕亮度 250 尼特左右, 屏幕刷新率 60hz; 键盘灯关闭, 接了个鼠标.</p>
      <p>独立显卡通过那个什么 mux 技术关闭了, 不知道是真的没有供电还是假装关掉.</p>
      <p>全屏播放 1080p 视频, 后台空跑了个 syncing, 还挂了一个 qq.</p>
      <p>
        重点来了, 续航做到了惊人的 <em><strong>2 小时 40 分钟</strong></em
        >, 没错就不到三个小时, 这货完全没有续航.
      </p>
      <hr />
      <p>各位有续航需求的旁友还是老老实实买苹果电脑罢.</p>
      <h6
        id="%E5%BD%93%E7%84%B6%E6%88%91%E5%B9%B3%E6%97%B6%E4%B9%9F%E6%98%AF%E5%BC%80%E7%9D%80-80%E7%94%B5%E6%B1%A0%E5%AE%B9%E9%87%8F%E6%A8%A1%E5%BC%8F-%E6%88%91%E6%A0%B9%E6%9C%AC%E6%B2%A1%E6%9C%89%E4%B8%8D%E6%8F%92%E7%94%B5%E8%BF%90%E8%A1%8C%E8%BF%B7%E4%BD%A0%E6%A0%B8%E5%BC%B9%E7%9A%84%E9%9C%80%E6%B1%82"
      >
        当然我平时也是开着 80%电池容量模式, 我根本没有不插电运行迷你核弹的需求
      </h6>
      <h2 id="%E5%85%B6%E4%BB%96%E9%94%90%E8%AF%84">其他锐评</h2>
      <p>实在是超出了我的预料, 这个电脑我宣布这事我买过最牛逼最值得最快乐的消费者电子产品.</p>
      <p>
        我一直认为这样的平板才是未来个人数字助手的真正形态, 在固体电池技术成熟和外接 xgm 能用 pci 5 的时候,
        就是这类迷你核弹的春天.
      </p>
      <hr />
      <p>今日节目到此结束, 感谢各位观看, 回见!</p>
    </div>
  </div>
</template>

<style>
img {
  max-width: 200px;
}
</style>
